# Чтение и запись данных, часть 2

## Домашнее задание 

### Описание домашнего задания и формат сдачи

Выполните предложенные задачи — впишите свой код в ячейки после комментария `### YOUR CODE HERE ###` и сохраните изменения, используя опцию *Save and Checkpoint* из вкладки меню *File* или кнопку *Save and Checkpoint* на панели инструментов. Итоговый файл в формате `.ipynb` (файл Jupyter Notebook) загрузите в личный кабинет и отправьте на проверку.

In [1]:
import pandas as pd
import urllib.request as req
import json
import sqlalchemy
import psycopg2
import pymongo

### Задача 1

Используя сервис MetaWeather узнайте, какая погода была в Лондоне 1 марта 2019 года. Для этого в первой ячейке определите идентификатор Лондона в этом сервисе, а во второй — запросите данные погоды. Обратите внимание, что сервис вернёт данные за несколько дней, а не только за 1 марта, в этой задаче это допустимо.

In [2]:
url = "https://www.metaweather.com/api/location/search/?query=london"

In [3]:
with req.urlopen(url) as session:
    response1 = session.read().decode()
    data = json.loads(response1)
city = data[0]['woeid']
city

44418

In [4]:
url = 'https://www.metaweather.com/api/location/2122265/2019/03/01/'
with req.urlopen(url) as session:
    response = session.read().decode()
    data = json.loads(response)

df = pd.read_json(url)
df.head()

,id,weather_state_name,weather_state_abbr,wind_direction_compass,created,applicable_date,min_temp,max_temp,the_temp,wind_speed,wind_direction,air_pressure,humidity,visibility,predictability
0,5819180131549184,Hail,h,N,2019-03-01T19:08:31.295563Z,2019-03-01,-6.166667,0.526667,0.725,6.991518,355.378078,985.055,86,6.424667,82
1,5815223493591040,Hail,h,N,2019-03-01T16:06:32.698487Z,2019-03-01,-6.166667,0.526667,0.725,6.991518,355.378078,985.055,86,6.424667,82
2,6469790367481856,Sleet,sl,N,2019-03-01T13:04:31.413430Z,2019-03-01,-5.943333,0.126667,0.725,7.001518,356.410812,985.055,87,6.045631,85
3,4804954709557248,Sleet,sl,N,2019-03-01T10:02:31.608477Z,2019-03-01,-5.943333,0.126667,0.725,7.001518,356.410812,985.055,87,6.045631,85
4,4577327147122688,Sleet,sl,N,2019-03-01T07:00:32.495819Z,2019-03-01,-5.943333,0.126667,0.725,7.001518,356.410812,985.055,87,6.045631,85

### Задача 2

Сохраните данные погоды, полученные в предыдущей задаче, в файл `weather.json`. При сохранении используйте четыре пробела для форматирования.

In [5]:
with open('weather.json', 'w') as file:
    json.dump(data, file, indent=4)

### Задача 3

Загрузите содержимое файла `weather.json` в DataFrame и выведите первые пять строк DataFrame на экран.

In [6]:
# with open('weather.json', 'r') as file:
#     data_json = json.load(file)

df1 = pd.read_json('weather.json')
df1.head()

,id,weather_state_name,weather_state_abbr,wind_direction_compass,created,applicable_date,min_temp,max_temp,the_temp,wind_speed,wind_direction,air_pressure,humidity,visibility,predictability
0,5819180131549184,Hail,h,N,2019-03-01T19:08:31.295563Z,2019-03-01,-6.166667,0.526667,0.725,6.991518,355.378078,985.055,86,6.424667,82
1,5815223493591040,Hail,h,N,2019-03-01T16:06:32.698487Z,2019-03-01,-6.166667,0.526667,0.725,6.991518,355.378078,985.055,86,6.424667,82
2,6469790367481856,Sleet,sl,N,2019-03-01T13:04:31.413430Z,2019-03-01,-5.943333,0.126667,0.725,7.001518,356.410812,985.055,87,6.045631,85
3,4804954709557248,Sleet,sl,N,2019-03-01T10:02:31.608477Z,2019-03-01,-5.943333,0.126667,0.725,7.001518,356.410812,985.055,87,6.045631,85
4,4577327147122688,Sleet,sl,N,2019-03-01T07:00:32.495819Z,2019-03-01,-5.943333,0.126667,0.725,7.001518,356.410812,985.055,87,6.045631,85

### Задача 4

Сохраните DataFrame из предыдущей задачи в файл `result.csv`. В качестве названия столбца-индекса используйте `index`.

In [7]:
df1.to_csv('result.csv', index_label='index')

### Задача 5

Загрузите содержимое SQL-таблицы `ratings` в DataFrame. Выведите первые пять строк DataFrame на экран. Для подключения к БД используйте строку подключения, указанную в следующей ячейке.

In [8]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

In [9]:
engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
inspector = sqlalchemy.inspect(engine)
inspector.get_table_names()
df = pd.read_sql("select * from ratings", connect)
df.head()

   userid  movieid  rating   timestamp
0     503     1240     5.0  1481653901
1     503     1258     4.5  1481661547
2     503     1270     4.5  1481731585
3     503     1275     5.0  1481731677
4     503     1291     5.0  1481653856

### Задача 6

Сохраните первые 10000 записей датафрейма из предыдущей задачи в файл `result2.xlsx`, при сохранении задайте листу имя `MySheet`.

(Примечание: для указания имени листа в файле Excel как при чтении, так и при записи используется параметр `sheet_name`)

In [10]:
df[:10000].to_excel('result2.xlsx', sheet_name='MySheet')

### Задача 7

Определите количество документов в коллекции `users` в MongoDB. Если количество документов < 1000, то в следующей ячейке загрузите всё содержимое этой коллекции в список и выведите нулевой элемент этого списка на экран. Для подключения к MongoDB используйте строку подключения, указанную в следующей ячейке.

In [62]:
conn = 'mongodb://students:X63673t47Gl03Sq@dsstudents.skillbox.ru:27017/?authSource=movies'

connect = pymongo.MongoClient(conn)
db = connect['movies']
db.list_collection_names()

['tags', 'users']

In [85]:
users = db['users']

In [86]:
users.find_one()

{'_id': ObjectId('5cc69095067496679c74f7a4'),
 'user_id': 'ed5da480-57a2-489c-8e68-512155ab9892',
 'first_name': 'Жанна',
 'last_name': 'Петрова',
 'mail': 'zhanna_03816@gmail.com',
 'age': 20.0}

In [83]:
users.count_documents({})

100

In [89]:
my_list = list(users.find())
my_list[0]

{'_id': ObjectId('5cc69095067496679c74f7a4'),
 'user_id': 'ed5da480-57a2-489c-8e68-512155ab9892',
 'first_name': 'Жанна',
 'last_name': 'Петрова',
 'mail': 'zhanna_03816@gmail.com',
 'age': 20.0}

### Задача 8

Преобразуйте список всех документов коллекции `users` из предыдущей задачи в pandas DataFrame и сохраните его содержимое в файл `result3.xlsx`.

In [91]:
df2save = pd.DataFrame(my_list)
df2save.to_excel('result3.xlsx')

## Дополнительные (необязательные) задачи

### Задача 9

Используя данные SQL-таблицы `ratings`, для каждого пользователя (столбец `userid`) определите средний рейтинг, который этот пользователь поставил фильмам. Результат выведите на экран. 

Группировку проведите двумя способами: с помощью `GROUP BY` в строке запроса к БД и с использованием метода `groupby` в pandas.

Для подключения к БД используйте строку подключения в следующей ячейке

In [11]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
inspector = sqlalchemy.inspect(engine)
inspector.get_table_names()
df1 = pd.read_sql("select userid as USER_ID, AVG(rating) as AVERAGE_RATING from ratings group by userid order by userid", connect)
df1.head()

   user_id  average_rating
0        1        4.277778
1        2        3.318182
2        3        3.100000
3        4        3.500000
4        5        4.269231

In [15]:
conn2 = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine2 = sqlalchemy.create_engine(conn2)
connect2 = engine2.connect()
inspector2 = sqlalchemy.inspect(engine2)
df2 = pd.read_sql("select * from ratings", connect2)

df2[['userid', 'rating']].groupby('userid').mean().sort_values('userid').head()

          rating
userid
1       4.277778
2       3.318182
3       3.100000
4       3.500000
5       4.269231

### Задача 10

Объедините таблицы `ratings` и `keywords` по столбцам `movieid` (используйте левое объединение). Объединение проведите двумя способами: с помощью `LEFT JOIN` в строке запроса к БД и с использованием метода `merge` в pandas. Результат объединения загрузите в DataFrame и сохраните в файл `result4.csv`.

Обратите внимание, что при объединении возможно дублирование столбцов. В результирующем датафрейме не должно быть таких дублированных столбцов.

In [25]:
conn3 = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine3 = sqlalchemy.create_engine(conn3)
connect3 = engine3.connect()
df3 = pd.read_sql("SELECT * FROM ratings LEFT JOIN keywords ON ratings.movieid = keywords.movieid ORDER BY userid", connect3)

# LEFT JOIN keywords ON ratings.movieid = keywords.movieid
df3.head()

,userid,movieid,rating,timestamp,movieid,tags
0,1,2918,5.0,1425941593,NaN,None
1,1,2918,5.0,1425941593,NaN,None
2,1,147,4.5,1425942435,147.0,"[{'id': 6930, 'name': 'fondling'}, {'id': 1018..."
3,1,81834,5.0,1425942133,NaN,None
4,1,147,4.5,1425942435,147.0,"[{'id': 6930, 'name': 'fondling'}, {'id': 1018..."

In [16]:
conn4 = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine4 = sqlalchemy.create_engine(conn4)
connect4 = engine4.connect()

df4_1 = pd.read_sql("SELECT * FROM ratings", connect4)
df4_2 = pd.read_sql("SELECT * FROM keywords", connect4)

# LEFT JOIN keywords ON ratings.movieid = keywords.movieid
df4_1.head()

   userid  movieid  rating   timestamp
0     503     1240     5.0  1481653901
1     503     1258     4.5  1481661547
2     503     1270     4.5  1481731585
3     503     1275     5.0  1481731677
4     503     1291     5.0  1481653856

In [17]:
df4_2.head()

   movieid                                               tags
0      862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1     8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2    15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3    31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4    11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...

In [28]:
df4 = pd.merge(df4_1, df4_2, how='left', on=['movieid']).sort_values('userid', ascending=False)
df4.tail()

,userid,movieid,rating,timestamp,tags
2167546,1,858,5.0,1425941523,"[{'id': 494, 'name': 'father son relationship'..."
2167547,1,1221,5.0,1425941546,NaN
2167548,1,1246,5.0,1425941556,"[{'id': 276, 'name': 'philadelphia'}, {'id': 3..."
2167549,1,1246,5.0,1425941556,"[{'id': 276, 'name': 'philadelphia'}, {'id': 3..."
1049277,1,59315,5.0,1425941502,NaN

In [29]:
df4.to_csv('result4.csv', index_label='index', sep=',')

### Задача 11

Используя объединенную таблицу из предыдущего задания, найдите все идентификаторы фильмов с тегом `africa` (но не `south africa` или любые другие). Список тегов в формате JSON записан в столбце `tags`.